{"id":11,"date":"2018-11-28T01:35:11","date_gmt":"2018-11-28T01:35:11","guid":{"rendered":"https:\/\/hotellaaibaresidency.com\/?page_id=11"},"modified":"2021-03-19T06:33:55","modified_gmt":"2021-03-19T06:33:55","slug":"about-us","status":"publish","type":"page","link":"https:\/\/hotellaaibaresidency.com\/about-us\/","title":{"rendered":"About us"},"content":{"rendered":"<p style=\"text-align: justify;\">Hotel Baga High Q offers a prime location, warm and pampering customer service, and modern multi-amenity rooms to give guests a delightful stay. Guests should book this hotel to get:<\/p>\n<p>Easy access to Jogeshwari Caves, Bombay Exhibition Centre, Nageshwar Temple, and Mahakali Caves.Modish AC rooms with all basic amenities such as TV, sitting areas, attached bathrooms, laptop table, and Wi-Fi.Well-trained and warm staff members eager to fulfill all your bespoke and on-demand requests.<\/p>\n<p><strong>Where We Are Located<\/strong><\/p>\n<p>Hotel Baga High Q is located on S.V. Road, near Jogeshwari Railway station (140 m).The closest railway station is Jogeshwari Railway station (140 m) and the Chhatrapati Shivaji International Airport is 8.5 km or 18 minutes by cab.<\/p>\n<p><strong>Our Rooms and Amenities<\/strong><\/p>\n<p>Hotel Baga High Q provides modern designed, multi-amenity rooms, with wooden furnishings and cushions.  All rooms are well-equipped with amenities like spotless linens, LCD TVs, wardrobe, mineral water bottles, chair and table, and attached bathroom with 24-hour running hot and cold water. The hotel provides facilities such as parking, housekeeping, 24×7 security, 100% power backup, and free Wi-Fi access.<\/p>\n<p><strong>Where to Eat<\/strong><\/p>\n<p>Guests can enjoy complimentary Indo-Continental breakfast at the hotel or order sumptuous meals to their rooms via room service.Foodies can find plenty of restaurants and cafes nearby such as Hotel Bostan, Delhi Zaika, Persia Darbar, Farmik, Oza Sweets, and Farsan.<\/p>\n<p><strong>What You’ll Love<\/strong><\/p>\n<p>Sightseeing: The hotel has plenty of sightseeing options nearby that guests can visit such as Jogeshwari caves (1.6 km), Nageshwar temple (3.1 km), Aadi Shakti Mata Mahakali Caves (4.6 km), Filmistan (3.5 km), Versova Beach (4.4 km), and Juhu beach (6.7 km).Nightlife: Guests who want to unwind after a long day work can head to Tipsy Gypsy (2.2 km), The Little Door (2.1 km), A Bar Called LIFE (5.4 km), and The Bar Stock Exchange (1.7 km) to grab dinner and drinks or to dance and have fun.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Hotel Baga High Q offers a prime location, warm and pampering customer service, and modern multi-amenity rooms to give guests a delightful stay. Guests should book this hotel to get: Easy access to Jogeshwari Caves, Bombay Exhibition Centre, Nageshwar Temple, and Mahakali Caves.Modish AC rooms with all basic amenities such as TV, sitting areas, attached bathrooms, [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"template-parts\/about-us.php","meta":[],"categories":[],"tags":[],"_links":{"self":[{"href":"https:\/\/hotellaaibaresidency.com\/wp-json\/wp\/v2\/pages\/11"}],"collection":[{"href":"https:\/\/hotellaaibaresidency.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/hotellaaibaresidency.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/hotellaaibaresidency.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/hotellaaibaresidency.com\/wp-json\/wp\/v2\/comments?post=11"}],"version-history":[{"count":6,"href":"https:\/\/hotellaaibaresidency.com\/wp-json\/wp\/v2\/pages\/11\/revisions"}],"predecessor-version":[{"id":187,"href":"https:\/\/hotellaaibaresidency.com\/wp-json\/wp\/v2\/pages\/11\/revisions\/187"}],"wp:attachment":[{"href":"https:\/\/hotellaaibaresidency.com\/wp-json\/wp\/v2\/media?parent=11"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/hotellaaibaresidency.com\/wp-json\/wp\/v2\/categories?post=11"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/hotellaaibaresidency.com\/wp-json\/wp\/v2\/tags?post=11"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}